Repository: Alex293/nabla-ios
Catalog: Sources/NablaScheduling/Resources/*.lproj/Localizable.strings
Languages: fr, pt

# universal_link_apple_maps
source: Apple Maps
fr: Plans

# appointments_screen_title
source: Appointments
fr: Rendez-vous
pt: Consultas

# appointments_screen_action_button_label
source: Schedule an appointment
fr: Prendre rendez-vous
pt: Marque uma consulta

# appointments_screen_selector_upcoming_label
source: Scheduled
fr: Prévus

# appointments_screen_selector_finalized_label
source: Past
fr: Passés
pt: Passadas

# appointments_screen_upcoming_empty_label
source: No appointments scheduled
fr: Pas de rendez-vous prévu

# appointments_screen_finalized_empty_label
source: No past appointments
fr: Pas de rendez-vous passé
pt: Nenhuma consulta anterior

# appointments_screen_cell_join_button_label
source: Join the call
fr: Rejoindre l'appel
pt: Participar da chamada

# appointments_screen_load_list_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# appointments_screen_load_list_error_message
source: Failed to load the appointments. Please try again.
fr: Impossible d'afficher vos rendez-vous. Réessayez.
pt: Ocorreu um erro ao carregar as consultas. Tente novamente.

# appointment_details_screen_title
source: Appointment
fr: Rendez-vous
pt: Consulta

# appointment_details_screen_action_button_label
source: Cancel appointment
fr: Annuler le rendez-vous
pt: Cancelar consulta

# appointment_details_screen_cancel_appointment_modal_title
source: Cancel appointment
fr: Annuler le rendez-vous ?
pt: Cancelar consulta?

# appointment_details_screen_cancel_appointment_modal_message
source: The appointment will be canceled.
fr: Voulez-vous annuler ce rendez-vous ? Cette action est définitive.
pt: Deseja cancelar esta consulta? Esta ação é final.

# appointment_details_screen_cancel_appointment_modal_confirm_button
source: Confirm cancellation
fr: Oui, annuler le rendez-vous
pt: Sim, cancele a consulta

# appointment_details_screen_cancel_appointment_modal_close_button
source: Keep appointment
fr: Non, maintenir le rendez-vous
pt: Não, mantenha a consulta

# appointment_details_screen_watch_appointment_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# appointment_details_screen_watch_appointment_error_message
source: Failed to load the appointment. Please try again.
fr: Impossible de trouver le rendez-vous. Réessayez.
pt: Falha ao carregar a consulta. Tente novamente.

# appointment_details_screen_cancel_appointment_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# appointment_details_screen_cancel_appointment_error_message
source: Failed to cancel the appointment. Please try again.
fr: Impossible d'annuler le rendez-vous. Réessayez.
pt: Falha ao carregar a consulta. Tente novamente.

# location_picker_screen_title
source: Select a location
fr: Choisissez le mode de rendez-vous
pt: Selecione um local

# location_picker_remote_location_name
source: Remote
fr: Téléconsultation
pt: Teleconsulta

# location_picker_physical_location_name
source: In-person
fr: Rendez-vous physique
pt: Consulta presencial

# location_picker_screen_empty_label
source: No locations available
fr: Aucun mode de rendez-vous disponible
pt: Nenhum local disponível

# location_picker_screen_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# location_picker_screen_error_message
source: Failed to display the locations. Please try again.
fr: Impossible d'afficher les modes de rendez-vous. Réessayez.
pt: Falha ao mostrar os locais. Tente novamente.

# category_picker_screen_title
source: Select a category
fr: Choisissez la catégorie
pt: Selecione uma categoria

# category_picker_screen_remote_location_disclaimer
source: The appointment will take place remotely.
fr: Il s’agit de téléconsultations par appel vidéo.
pt: A consulta será via internet.

# category_picker_screen_physical_location_disclaimer
source: The appointment will take place in-person.
fr: Il s’agit de consultations physiques.
pt: A consulta será presencial.

# category_picker_screen_empty_label
source: No categories available
fr: Pas de catégories disponibles
pt: Nenhuma categoria disponível

# category_picker_screen_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# category_picker_screen_error_message
source: Failed to display the categories. Please try again.
fr: Impossible d'afficher la liste des catégories. Réessayez.
pt: Falha ao mostrar os locais. Tente novamente.

# time_slots_screen_title
source: Select a date
fr: Choisissez la date de rendez-vous
pt: Selecione uma data

# time_slots_screen_action_button_label
source: Confirm
fr: Confirmer
pt: Confirmar

# time_slots_picker_screen_group_subtitle_format
source: %d available slots
fr: %d disponibilités
pt: %d disponibilidades

# time_slots_picker_screen_empty_label
source: No availabilities
fr: Pas de créneaux disponibles
pt: Nenhuma disponibilidade

# time_slots_picker_screen_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# time_slots_picker_screen_error_message
source: Failed to display the availabilities. Please try again.
fr: Impossible d'afficher la liste des créneaux. Réessayez.
pt: Falha ao mostrar as disponibilidades. Tente novamente.

# confirmation_screen_title
source: Confirm your appointment
fr: Confirmez votre rendez-vous
pt: Confirme sua consulta

# confirmation_screen_consultation_disclaimer
source: I consent to do a video consultation.
fr: Je consens à réaliser un appel vidéo.
pt: Eu aceito realisar uma consulta por vídeo.

# confirmation_screen_data_disclaimer
source: I consent to the data processing policy.
fr: Je consens au traitement de mes données personnelles.
pt: Eu aceito a política de tratamento de dados.

# confirmation_screen_error_title
source: Something went wrong
fr: Une erreur est survenue
pt: Ocorreu um erro

# confirmation_screen_error_message
source: Failed to schedule appointment. Please try again.
fr: Impossible de confirmer le rendez-vous. Réessayez.
pt: Falha ao agendar a consulta. Tente novamente.

# confirmation_screen_error_retry_button
source: Retry
fr: Réessayer
pt: Tentar novamente
